<?php
$_TF_START_TS = 1393477200; // 2014-02-27 05:00:00
$_TF_EFFECTS_URI = array(
    '/i/cart/show',
    '/i/cart/confirmation',
); // 限流针对的 url 地址
$_TF_LEVEL = 3; // 限流用户比例 (%)
$_TF_TTL = 300; // 用户排队时间 (s)
$_TF_EXPIRE_TS = 2000; // 用户可操作时间 (s)

$_TF_REDIRECT_TO = 'http://queue.jumei.com/';
///////////////////////////////////
// 每行必须是 aa.bb.cc，其它格式无效
///////////////////////////////////
$_TF_WHITE_IP_LIST = array(
    // rd center
    '182.148.123' => 1,
    '119.6.200' => 1,
    // bj office
    '211.103.164' => 1,
    '59.108.33' => 1,
    '111.193.165' => 1,
    '114.248.215' => 1,
    // new office
    '119.57.166' => 1,
    '119.61.4' => 1,
    '117.79.156' => 1,
    '210.78.137' => 1,
    '111.193.162' => 1,
    // jiankongbao
    '60.195.252' => 1,
    '60.195.249' => 1,
);

//////////// EOF
